package com.company;

import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
        System.out.println("Привет, Дружок\n"+
                "    (⌒ω⌒)\n"+
                "Жедаю тебя удачкки\n"+
                "   ＼(≧▽≦)／");
        game();

        System.out.println("Хотители вы продолжить игру?");
        Scanner ch = new Scanner(System.in);
        String playnext = ch.nextLine();
        if (playnext.equals("да")) {
            go();
        }
        if (playnext.equals("нет")) {
            System.out.println("Спасибо, что были с нами))\n"+
                    "        ♡(≧◡≦)♡");
        }

    }
    public static void go() {
        game();
        System.out.println("Хотители вы продолжить игру?");
        Scanner ch = new Scanner(System.in);
        String playnext = ch.nextLine();
        if (playnext.equals("да")) {
            go();
        }
        if (playnext.equals("нет")) {
            System.out.println("Спасибо, что были с нами))");
        }

    }
    public static void game() {
        int kw = 0;
        int L = 0;
        int N = 0;
        System.out.println("Итак теперь выбери: \n" +
                "1 камень \n" +
                "2 ножницы \n" +
                "3 бумага \n");
        Scanner scanner = new Scanner(System.in);
        int p1 = scanner.nextInt();

        System.out.println("Твой противник выбирает: \n" +
                "1 камень \n" +
                "2 ножницы \n" +
                "3 бумага \n");
        Scanner scanner1 = new Scanner(System.in);
        int p2 = scanner1.nextInt();
        if (p1 == 1) {
            if (p2 == 1) {
                N++;
            } else if (p2 == 2) {
                kw++;
            } else if (p2 == 3) {
                L++;
            }
        }
        if (p1 == 2) {
            if (p2 == 1) {
                L++;
            } else if (p2 == 2) {
                N++;
            } else if (p2 == 3) {
                kw++;
            }
        }
        if (p1 == 3) {
            if (p2 == 1) {
                kw++;
            } else if (p2 == 2) {
                L++;
            } else if (p2 == 3) {
                N++;
            }
        }
        if (kw == 1) {
            System.out.println("Вы выиграли \n" +
                    "░░░░░░░▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄░░░░░\n"+
                    "░░░▄▄▄▄████████████▀▀█▄▄▄▄░\n"+
                    "░░░█▄░░████████████░░█░░░█░\n"+
                    "░░░░█░░████████████░▄█░░█░░\n"+
                    "░░░░░▀▄░██████████░░█░▄▀░░░\n"+
                    "░░░░░░░▀▀████████▀░█▀▀░░░░░\n"+
                    "░▄░░░░░░░░▀█████▀▄▀░░░░░▄█▄\n"+
                    "▀█▀░░░░░░░░░▀███▀░░░░░░░░▀░\n"+
                    "░░░░░░░▄░░░░░░█░░░░░░░░░░░░\n"+
                    "░░░░░░▀█▀░░░░░█░░░░░░░░░░░░\n"+
                    "░░░░░░░░░░░░░▄█▄░░░░░░░░░░░\n"+
                    "░░░░░░░░░░▄▄▄███▄▄▄░░░░░░░░\n"+
                    "░░░░░░░▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄░░░░░\n"+
                    "░░░░░░░███████████████░░░░░\n"+
                    "░░░░░░░████▀▀▀▀▀▀▀████░░░░░\n"+
                    "░░░░░░░███░░░░░░░░░███░░░░░\n"+
                    "░░░░░░░████▄▄▄▄▄▄▄████░░░░░\n"+
                    "░░░░░░░███████████████░░░░░\n"+
                    "░░░░░▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄░░░\n");
        } else if (L == 1) {
            System.out.println("Вы проиграли\n"+
                    "░░░░░░░░░░░█████████████░░░░░░\n" +
                    "░░░░░░░░░███░███░░░░░░██░░░░░░\n" +
                    "░░░░██████░░░░██░██████████░░░\n" +
                    "░░░█████░░░░░░████░░░░░░░██░░░\n" +
                    "░░██░░░░░░░░░░██░░███████████░\n" +
                    "░░██░░░░░░░░░░░███░░░░░░░░░██░\n" +
                    "░░██░░░░░░░░░░░███░██████████░\n" +
                    "░░██░░░░░░░░░░░░████░░░░░░░██░\n" +
                    "░░██░░░░░░░░░░░░░███░█████░░██\n" +
                    "░░░██████░░░░░░░░░░████░░░░░██\n" +
                    "░░░░░░░░███░░░░░░░░░░░░█████░░\n" +
                    "░░░░░░░░░███░░░░░░░██████░░░░░\n" +
                    "░░░░░░░░░░░██░░░░░░██░░░░░░░░░\n" +
                    "░░░░░░░░░░░░███░░░░░██░░░░░░░░\n" +
                    "░░░░░░░░░░░░░░██░░░░██░░░░░░░░\n" +
                    "░░░░░░░░░░░░░░░███░░░██░░░░░░░\n" +
                    "░░░░░░░░░░░░░░░░░██░░░██░░░░░░\n" +
                    "░░░░░░░░░░░░░░░░░██░░░██░░░░░░\n" +
                    "░░░░░░░░░░░░░░░░░░██░██░░░░░░░\n" +
                    "░░░░░░░░░░░░░░░░░░████░░░░░░░░");
        } else if (N == 1) {
            System.out.println("Ничья");
        }
    }

}